Enums/ВариантыОтраженияРасхождений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ВариантыОтраженияРасхождений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НедостачиЗаСчетСтороннейКомпании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НедостачиЗаСчетПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НедостачиНаПрочиеРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзлишкиВПользуПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзлишкиНаПрочиеДоходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыРасхождений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ВариантыРасхождений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Излишки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Недостачи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыОтраженияРасхождений/Ext/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВариантРасхождений") Тогда
	
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений();
		
		Если Параметры.ВариантРасхождений = Перечисления.ВариантыРасхождений.Излишки Тогда
			
			ДанныеВыбора.Добавить(Перечисления.ВариантыОтраженияРасхождений.ИзлишкиВПользуПоставщика);
			ДанныеВыбора.Добавить(Перечисления.ВариантыОтраженияРасхождений.ИзлишкиНаПрочиеДоходы);
			
		ИначеЕсли Параметры.ВариантРасхождений = Перечисления.ВариантыРасхождений.Недостачи Тогда
			
			ДанныеВыбора.Добавить(Перечисления.ВариантыОтраженияРасхождений.НедостачиЗаСчетПоставщика);
			ДанныеВыбора.Добавить(Перечисления.ВариантыОтраженияРасхождений.НедостачиЗаСчетСтороннейКомпании);
			ДанныеВыбора.Добавить(Перечисления.ВариантыОтраженияРасхождений.НедостачиНаПрочиеРасходы);
			
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
